Белгипрозем_2017/src/InformationRegisters/мОбменЕРИП/мОбменЕРИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мОбменЕРИП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.мСостояниеОбменЕРИП</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплатитьДо</name>
    <comment>Крайний срок оплаты требования</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/мСметнаяСтоимость/мСметнаяСтоимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мСметнаяСтоимость</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.мСтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоУчастков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.УчетДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/AccumulationRegisters/РасчетыСПокупателями/РасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПокупателями</name>
  <resources>
    <name>Сумма</name>
    <comment>Сумма с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <comment>Дата расчетного документа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаимозачета</name>
    <type>
      <types>EnumRef.мВидыВзаимозачета</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПлатежа</name>
    <type>
      <types>CatalogRef.мСпособыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСписанияЗадолженности</name>
    <type>
      <types>EnumRef.мВидыСписанияЗадолженности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/Enums/мСостояниеОбменЕРИП/мСостояниеОбменЕРИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мСостояниеОбменЕРИП</name>
  <enumValues>
    <name>ДляОтправки</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>Оплачен</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/CommonModules/мОбменЕРИПСервер/Module.bsl
Процедура ЗарегистрироватьДоговорДляОбменаЕРИПНаСервере(МассивДоговоров) Экспорт
	
	ТзДог = ПолучитьСуммыДляЕРИП(МассивДоговоров);
	
	НаборЗаписей = РегистрыСведений.мОбменЕРИП.СоздатьНаборЗаписей();
	
	ОплатитьДо = мОбменЕРИПСервер.ОплатитьЕРИПДо(ТекущаяДата());
	
	Для каждого Договор Из МассивДоговоров Цикл
		
		ИскСтрока = ТзДог.Найти(Договор, "Договор");
		
		Если ИскСтрока = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Договор "+Договор+" не зарегистрирован. Проверьте сметную стоимость договора.";
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли; 
		
		Если ИскСтрока.Сумма > 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Период = ТекущаяДата();
			Запись.Договор = Договор;
			Запись.Сумма = ИскСтрока.Сумма;
			Запись.Состояние = Перечисления.мСостояниеОбменЕРИП.ДляОтправки;
			Запись.ОплатитьДо = ОплатитьДо;
		КонецЕсли; 
	КонецЦикла; 
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Зарегистрировано "+НаборЗаписей.Количество()+" договоров";
		Сообщение.Сообщить(); 
		
		НаборЗаписей.Записать(Ложь);
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьСостоянияДоговоров(МассивДоговоров)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мОбменЕРИПСрезПоследних.Договор,
		|	мОбменЕРИПСрезПоследних.Состояние,
		|	мОбменЕРИПСрезПоследних.Сумма,
		|	мОбменЕРИПСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.мОбменЕРИП.СрезПоследних(, Договор В (&МассивДоговоров)) КАК мОбменЕРИПСрезПоследних";
	
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьСостоянияДоговоров()

Функция ПолучитьКаталогОбменаЕРИП() Экспорт
	Если ПолучитьФункциональнуюОпцию("М_ИспользоватьОбменЕРИП") Тогда
		Возврат Константы.М_КаталогОбменЕРИП.Получить();
	Иначе
		Возврат "";
	КонецЕсли; 
КонецФункции // ПолучитьКаталогОбменаЕРИП()

Процедура ЗарегистрироватьСостояниеЕРИП(Договор, Состояние, ИмяФайла="", Сумма=0, ОплатитьДо = "") Экспорт
	НаборЗаписей = РегистрыСведений.мОбменЕРИП.СоздатьНаборЗаписей();
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ТекущаяДата();
	Запись.Договор = Договор;
	Запись.Сумма = Сумма;
	Запись.ИмяФайла = ИмяФайла;
	Запись.Состояние = Состояние;
	Если НЕ ЗначениеЗаполнено(ОплатитьДо) Тогда
		ОплатитьДо = мОбменЕРИПСервер.ОплатитьЕРИПДо(ТекущаяДата());
	КонецЕсли;
	Запись.ОплатитьДо = ОплатитьДо;
	НаборЗаписей.Записать(Ложь);
КонецПроцедуры

Функция ОплатитьЕРИПДо(НачДата = "") Экспорт
	Если Не ЗначениеЗаполнено(НачДата) Тогда
		НачДата = ТекущаяДата();
	КонецЕсли; 
	ПериодОплаты = Константы.мПериодОплатыЕРИП.Получить() + 1;
	ОплатитьДо = НачалоДня(НачДата + ПериодОплаты * 24*3600);
	Возврат ОплатитьДо;
КонецФункции 

Функция ПолучитьСуммыДляЕРИП(МассивДоговоров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(мСметнаяСтоимостьСрезПоследних.Сумма) КАК Сумма,
		|	мСметнаяСтоимостьСрезПоследних.ЭтапДоговора.Владелец КАК Договор
		|ПОМЕСТИТЬ Стоимости
		|ИЗ
		|	РегистрСведений.мСметнаяСтоимость.СрезПоследних(, ЭтапДоговора.Владелец В (&МассивДоговоров)) КАК мСметнаяСтоимостьСрезПоследних
		|ГДЕ
		|	НЕ мСметнаяСтоимостьСрезПоследних.ЭтапДоговора.ПометкаУдаления
		|	И НЕ мСметнаяСтоимостьСрезПоследних.ЭтапДоговора.ИсключенИзДоговора
		|
		|СГРУППИРОВАТЬ ПО
		|	мСметнаяСтоимостьСрезПоследних.ЭтапДоговора.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСПокупателямиОбороты.Договор КАК Договор,
		|	ЕСТЬNULL(РасчетыСПокупателямиОбороты.СуммаПриход, 0) КАК Оплата
		|ПОМЕСТИТЬ Оплаты
		|ИЗ
		|	РегистрНакопления.РасчетыСПокупателями.Обороты(, , , Договор В (&МассивДоговоров)) КАК РасчетыСПокупателямиОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Стоимости.Договор КАК Договор,
		|	Стоимости.Сумма - ЕСТЬNULL(Оплаты.Оплата, 0) КАК Сумма
		|ИЗ
		|	Стоимости КАК Стоимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ Оплаты КАК Оплаты
		|		ПО Стоимости.Договор = Оплаты.Договор";
	
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
КонецФункции
